spec/fixtures/responses/admin/ping/failure.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.channeladvisor.com/ChannelAdvisorAPI/v6/AdminService.asmx
    body:
      encoding: US-ASCII
      string: <?xml version="1.0" encoding="UTF-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:web="http://api.channeladvisor.com/webservices/"><soap:Header><web:APICredentials><web:DeveloperKey>WRONG
        KEY</web:DeveloperKey><web:Password>$$PASSWORD$$</web:Password></web:APICredentials></soap:Header><soap:Body><web:Ping/></soap:Body></soap:Envelope>
    headers:
      soapaction:
      - ! '"http://api.channeladvisor.com/webservices/Ping"'
      content-type:
      - text/xml;charset=UTF-8
      content-length:
      - '365'
      accept:
      - ! '*/*'
      user-agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      date:
      - Sat, 19 May 2012 15:24:51 GMT
      server:
      - Microsoft-IIS/6.0
      x-servername:
      - RDU-IISWEB-11
      x-powered-by:
      - ASP.NET
      x-aspnet-version:
      - 4.0.30319
      cache-control:
      - private
      content-type:
      - text/xml; charset=utf-8
      content-length:
      - '517'
    body:
      encoding: US-ASCII
      string: <?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><PingResponse
        xmlns="http://api.channeladvisor.com/webservices/"><PingResult><Status>Failure</Status><MessageCode>0</MessageCode><Message><%= message %></Message><ResultData>false</ResultData></PingResult></PingResponse></soap:Body></soap:Envelope>
      http_version: '1.1'
  recorded_at: Sat, 19 May 2012 15:24:51 GMT
recorded_with: VCR 2.1.1
